# GenerateCurves Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IRebarUpdateServer..::..GenerateCurves Method
IRebarUpdateServer Interface See Also
---
This function is supposed to calculate the bars in set based on data received in curvesData parameter.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
bool GenerateCurves(
	RebarCurvesData curvesData
)
```

Visual Basic
---
```text
Function GenerateCurves ( _
	curvesData As RebarCurvesData _
) As Boolean
```

Visual C++
---
```text
bool GenerateCurves(
	RebarCurvesData^ curvesData
)
```

# ### Parameters
curvesData
    Type: Autodesk.Revit.DB.Structure..::..RebarCurvesData Use the members of this class to access the inputs and define the output curves that make up the free form rebar.
# ### Return Value
Returns true if the curve generation was successful, false otherwise.
# Remarks
This function is called in the regeneration context when at least one data in curvesData parameter was changed.
# See Also
IRebarUpdateServer Interface
Autodesk.Revit.DB.Structure Namespace